"""Напишите программу для слияния нескольких словарей в один."""
d = {
    "val1": 9,
    "val2": 3,
    "val3": 5,
    "val4": 4,
    "val5": 8
}
di = {
    "val6": 1,
    "val7": 2,
    "val8": 6,
    "val9": 7,
    "val10": 10
}
result={**d,**di}
print(result)
